{
  "client": "Data Parser | Freshcode",
  "description": "Data Parser is a cloud-based application the main function of which is the analysis of unstructured data from any number of sources.",
  "site": "under construction",
  "link": "",
  "industry": "Big Data",
  "country": "the USA",
  "teamSize": "4 people",
  "techUsed": "Java, MongoDB, Elasticsearch, RabbitMQ, PostgresSQL, Spring, Hibernate, AngularJS, Bootstrap, RequireJS",
  "projDuration": "9 months",
  "pdf": "pdf/freshcode_case_studies_data_parser.pdf",
  "images": ["/img/data-parser/iMac.png", "/img/data-parser/application.png", "/img/data-parser/data_parser_logo.png"],
  "challenges": "Our client needed a cloud-based ETL application for unstructured data from any number of sources, including JSON files, with advanced search and data aggregation possibilities. The structure was supposed to have scaling up possibilities and user-friendly interface for entry-level users. Regular index synchronization with external sources was a must along with providing API for third-party services.",
  "buisValue": "Our client is going to provide Big Data services to IT giants such as Google and IBM. Data Parser customers will be able to choose between two subscription plans. Large companies with a huge amount of data will get access to dedicated large storage servers for quick calculations. Shared services with lower productivity will be provided to smaller customers with simpler needs.",
  "solutions": "The unique pre-processor to facilitate the work of Elastic Search with unstructured data was created. The self-adapting algorithm was implemented for join-type operations to accelerate processing speed and improve system's productivity. For quick and secure data exchange, message broker was created based on RabbitMQ and MongoDB. The user-friendly ETL editor was developed for entry-level customers with synchronization abilities to prevent conflicts. The number of users can be adapted by changing allocation block’s parameters.",
  "css": "data-parser",
  "prev": "/outdoor",
  "next": "/round-forest"
}