{
  "client": "Outdoor.rocks | Freshcode",
  "title": "Outdoor.rocks | Freshcode",
  "description":"Outdoor.rocks is an interactive online tool with Google Map support created for outdoor activity lovers to create and edit new trails in 3 different modes.",
  "site": "outdoor.rocks",
  "link": "http://outdoor.rocks",
  "industry": "Tourism",
  "country": "Ukraine",
  "teamSize": "3 people",
  "techUsed": "Ruby on Rails, Elasticsearch, Postgres, Angular.js, CSS 3, HTML 5",
  "projDuration": "3 months",
  "pdf": "pdf/freshcode_case_studies_outdoor.pdf",
  "images": [
    {"alt":"Outdoor.rocks Homepage", "img":"/img/outdoor/Curves.jpg"},
    {"alt":"Outdoor.rocks Logo", "img":"/img/outdoor/logo.png"},
    {"alt":"Outdoor.rocks Trail Description page", "img":"/img/outdoor/macbook_left.png"}
  ],
  "challenges": "Outdoor.rocks is a young, but rapidly developing project, designed for outdoor activity lovers around the world. The company was in need of an interactive online tool with Google Map and OpenStreetMap support to create and edit new trails in 3 different modes. Also, one of the requirements was adding text, coordinates and photos for geographical locations. Our client desired access rights division according to registered user’s status and automatic detection of user’s location and subsequent localization switching.",
  "buisValue": "Outdoor.rocks site is still undergoing development. Our client is now widening the range of services available to users and filling the site with useful content. Industry experts have already given high praise to the project, making it a desirable investment opportunity for several US companies. At the moment, our client conducts negotiations with several potential investors interested in site's further development.",
  "solutions": "This project was developed using Ruby on Rails framework. Three editing modes were implemented: automatic, manual and mixed. Users got access to the banks of geo referenced photos at Flickr.com to attach pictures to new routes along with any additional information. Working on this challenging project our team created the unique trail points thinning algorithm for GPS files downloads and devised the library for Google Charts and seamless performance of elevation profile data.",
  "css": "outdoor",
  "prev": "/transacumen",
  "next": "/data-parser"
}
