{
  "client": "Play Attention | Freshcode",
  "title": "Play Attention | Freshcode",
  "description":"Play Attention is a cognitive training system with the main purpose to improve attention, behaviour and cognitive function of people who suffer from ADHD.",
  "site": "playattention.com",
  "industry": "Education, Healthcare",
  "country": "USA",
  "teamSize": "2 people",
  "techUsed": "NWJS (node.js + webkit), Angular.JS, Typescript, Loki.JS (in-memory database), CouchDB",
  "projDuration": "1 year, ongoing",
  "pdf": "pdf/freshcode_case_studies_play_attention.pdf",
  "body_color": "#586987",
  "images": [
    {"alt":"Play Attention Homepage", "img":"/img/playattention/iMac.png"},
    {"alt":"Play Attention Students page", "img":"/img/playattention/iMac_view_left.png"},
    {"alt":"Play Attention Reports page", "img":"/img/playattention/iMac_view_right.png"}
  ],
  "challenges": "Play Attention is indisputably the best cognitive training system created to improve attention, behavior and cognitive function for children and adults suffering from ADHD. It was time to replace the previous version with a new application aiming for better interface, user-friendliness and flexibility. New version of the application was aimed not only at individual students, but also at learning groups, so one of the main objectives was the implementation of ILAP network solutions.",
  "buisValue": "Play Attention is now replacing the previous version of the application with the one created by our team. The company expects an influx of new users thanks to the many advantages of the new version. Play Attention devices would be sold through official distributors throughout the USA and Europe.",
  "solutions": "Our team created the desktop application for Windows and Mac to aggregate gaming statistics throughout every exercise session and to create new session plans that can be customized. Desktop application possesses three layers of access for admins, coaches and learners, who can now study independently without supervision. ILAP network solution allows one coach to work with a group of learners simultaneously using webcam transmissions along with a customized video-chat solution.",
  "css": "playattention",
  "prev": "/data-parser",
  "next": "/gommehd"
}
