{
  "client": "Wallbreaker Dynamics | Freshcode",
  "title": "Wallbreaker Dynamics | Freshcode",
  "description":"Wallbreaker Dynamics is a platform that allows users to create content instantly, monitor polls voting process and visualize analytic results in real time.",
  "site": "wallbreakerdynamics.com",
  "link": "http://wallbreakerdynamics.com",
  "industry": "Media, Entertainment",
  "country": "Denmark",
  "teamSize": "10 people",
  "techUsed": "Java, MongoDB, Elasticsearch, RabbitMQ, PostgresSQL, Spring, Hibernate, AngularJS, Bootstrap, RequireJS",
  "projDuration": "9 months",
  "pdf": "pdf/freshcode_case_studies_wallbreaker.pdf",
  "workStages": "Development, Quality Assurance, Launch",
  "body_color": "#3e3f43",
  "images": [
    {"alt":"Wallbreaker Dynamics Lobby manager page", "img":"/img/wallbreaker/Curves.jpg"},
    {"alt":"Wallbreaker Dynamics Logo", "img":"/img/wallbreaker/logo.png"},
    {"alt":"Wallbreaker Dynamics Poll page on a laptop", "img":"/img/wallbreaker/macbook_left.png"}
  ],
  "challenges": "Wallbreaker is a successful Danish start-up that provides unique services for mass-media. Our team worked on creating Pollmaker Suite for administrators and Pollbreaker mobile app for users. This platform will be used to create content instantly, monitor polls voting process and visualize analytic results in real time.",
  "buisValue": "Wallbreaker Dynamics platform was demonstrated at an expo in the USA and received high praise from media industry representatives. Initial success allowed our client to secure investments for the next development stages. Several contracts have already been signed with European TV channels.",
  "solutions": "Our team created the platform able to  withstand a significant number of users (up to 300,000) while maintaining a good response time (up to 1 second). A simple interface allows polls creation, live processing and survey results displaying in real time. Pollmaker Suite has possibilities for access rights administration and shared use and includes polls constructor and settings for calculations and data visualization.",
  "css": "wallbreaker",
  "prev": "/gommehd",
  "next": "/flotron"
}